In [19]:
from pyspark.sql import SparkSession

# Create a SparkSession
spark = SparkSession.builder.appName("https://github.com/maheshkshi400/MK").getOrCreate()


df = spark.read.format('csv') \
    .option('inferschema', True) \
    .option('header',True)\
    .option('sep',",")\
    .load('C:/Users/Pc/juypter/empdf12.csv')
df.show()

+---+-----------------+------+----+------+-------+------+---------+
| id|             name|gender| age|salary|   dept|deptno|      doj|
+---+-----------------+------+----+------+-------+------+---------+
|  1|Mahesh Kshirsagar|  male|  20|  5000|     IT|    50|19-4-2011|
|  2|   Shruthi Sharma|female|None|  6000|     HR|  NULL|20-5-2007|
|  3|   Ganesh Kenjale|  male|  25|  NULL|FINANCE|    30|     NULL|
|  4|    Pooja Chandra|female|NULL|  8000|PAYROLL|    40|14-4-1998|
|  5|     kamini sinha|female|  31|  6000|     IT|    50|20-5-2002|
|  6|        Rahul Roy|  NULL|  28|  NULL|   NULL|    10|31-8-2015|
|  7|    Shweta Tiwari|female|  30|  6000|     HR|    20|     NULL|
|  8|   suresh Katwani|  NULL|  25| 10000|FINANCE|    30|22-3-2007|
|  9|             NULL|  NULL|NULL|  NULL|   NULL|  NULL|     NULL|
| 10|   prachi Inamdar|female|  30|  6000|   NULL|    50|     NULL|
+---+-----------------+------+----+------+-------+------+---------+

In [20]:
# Method 1

from pyspark.sql.functions import split

df1= df.withColumn('first_name',split(df['name'],' ').getItem(0))\
    .withColumn('last_name',split(df['name'],' ').getItem(1))

df1.show()

+---+-----------------+------+----+------+-------+------+---------+----------+----------+
| id|             name|gender| age|salary|   dept|deptno|      doj|first_name| last_name|
+---+-----------------+------+----+------+-------+------+---------+----------+----------+
|  1|Mahesh Kshirsagar|  male|  20|  5000|     IT|    50|19-4-2011|    Mahesh|Kshirsagar|
|  2|   Shruthi Sharma|female|None|  6000|     HR|  NULL|20-5-2007|   Shruthi|    Sharma|
|  3|   Ganesh Kenjale|  male|  25|  NULL|FINANCE|    30|     NULL|    Ganesh|   Kenjale|
|  4|    Pooja Chandra|female|NULL|  8000|PAYROLL|    40|14-4-1998|     Pooja|   Chandra|
|  5|     kamini sinha|female|  31|  6000|     IT|    50|20-5-2002|    kamini|     sinha|
|  6|        Rahul Roy|  NULL|  28|  NULL|   NULL|    10|31-8-2015|     Rahul|       Roy|
|  7|    Shweta Tiwari|female|  30|  6000|     HR|    20|     NULL|    Shweta|    Tiwari|
|  8|   suresh Katwani|  NULL|  25| 10000|FINANCE|    30|22-3-2007|    suresh|   Katwani|
|  9|             NULL|  NULL|NULL|  NULL|   NULL|  NULL|     NULL|      NULL|      NULL|
| 10|   prachi Inamdar|female|  30|  6000|   NULL|    50|     NULL|    prachi|   Inamdar|
+---+-----------------+------+----+------+-------+------+---------+----------+----------+

In [21]:
# Method 2

import pyspark

split_col=pyspark.sql.functions.split(df['name'],' ')

df2=df.withColumn('First_name',split_col.getItem(0))\
    .withColumn('Last_name',split_col.getItem(1))

df2.show()

+---+-----------------+------+----+------+-------+------+---------+----------+----------+
| id|             name|gender| age|salary|   dept|deptno|      doj|First_name| Last_name|
+---+-----------------+------+----+------+-------+------+---------+----------+----------+
|  1|Mahesh Kshirsagar|  male|  20|  5000|     IT|    50|19-4-2011|    Mahesh|Kshirsagar|
|  2|   Shruthi Sharma|female|None|  6000|     HR|  NULL|20-5-2007|   Shruthi|    Sharma|
|  3|   Ganesh Kenjale|  male|  25|  NULL|FINANCE|    30|     NULL|    Ganesh|   Kenjale|
|  4|    Pooja Chandra|female|NULL|  8000|PAYROLL|    40|14-4-1998|     Pooja|   Chandra|
|  5|     kamini sinha|female|  31|  6000|     IT|    50|20-5-2002|    kamini|     sinha|
|  6|        Rahul Roy|  NULL|  28|  NULL|   NULL|    10|31-8-2015|     Rahul|       Roy|
|  7|    Shweta Tiwari|female|  30|  6000|     HR|    20|     NULL|    Shweta|    Tiwari|
|  8|   suresh Katwani|  NULL|  25| 10000|FINANCE|    30|22-3-2007|    suresh|   Katwani|
|  9|             NULL|  NULL|NULL|  NULL|   NULL|  NULL|     NULL|      NULL|      NULL|
| 10|   prachi Inamdar|female|  30|  6000|   NULL|    50|     NULL|    prachi|   Inamdar|
+---+-----------------+------+----+------+-------+------+---------+----------+----------+

In [22]:
# Method 3

from pyspark.sql.functions import split,col

split_col=pyspark.sql.functions.split(df['doj'],'-')

df3=df.select("id","name","gender","age","salary","doj",
              split_col.getItem(0).alias('joining_day'),
              split_col.getItem(1).alias('joining_month'),
              split_col.getItem(2).alias('joining_year'))

df3.show()

+---+-----------------+------+----+------+---------+-----------+-------------+------------+
| id|             name|gender| age|salary|      doj|joining_day|joining_month|joining_year|
+---+-----------------+------+----+------+---------+-----------+-------------+------------+
|  1|Mahesh Kshirsagar|  male|  20|  5000|19-4-2011|         19|            4|        2011|
|  2|   Shruthi Sharma|female|None|  6000|20-5-2007|         20|            5|        2007|
|  3|   Ganesh Kenjale|  male|  25|  NULL|     NULL|       NULL|         NULL|        NULL|
|  4|    Pooja Chandra|female|NULL|  8000|14-4-1998|         14|            4|        1998|
|  5|     kamini sinha|female|  31|  6000|20-5-2002|         20|            5|        2002|
|  6|        Rahul Roy|  NULL|  28|  NULL|31-8-2015|         31|            8|        2015|
|  7|    Shweta Tiwari|female|  30|  6000|     NULL|       NULL|         NULL|        NULL|
|  8|   suresh Katwani|  NULL|  25| 10000|22-3-2007|         22|            3|        2007|
|  9|             NULL|  NULL|NULL|  NULL|     NULL|       NULL|         NULL|        NULL|
| 10|   prachi Inamdar|female|  30|  6000|     NULL|       NULL|         NULL|        NULL|
+---+-----------------+------+----+------+---------+-----------+-------------+------------+

In [25]:
# combine multple split

df4= df.withColumn('first_name',split(df['name'],' ').getItem(0))\
       .withColumn('last_name',split(df['name'],' ').getItem(1))\
        .withColumn('joining_day',split(df['doj'],'-').getItem(0))\
        .withColumn('joining_month',split(df['doj'],'-').getItem(1))\
        .withColumn('joining_year',split(df['doj'],'-').getItem(2))
    
df4.show()

+---+-----------------+------+----+------+-------+------+---------+----------+----------+-----------+-------------+------------+
| id|             name|gender| age|salary|   dept|deptno|      doj|first_name| last_name|joining_day|joining_month|joining_year|
+---+-----------------+------+----+------+-------+------+---------+----------+----------+-----------+-------------+------------+
|  1|Mahesh Kshirsagar|  male|  20|  5000|     IT|    50|19-4-2011|    Mahesh|Kshirsagar|         19|            4|        2011|
|  2|   Shruthi Sharma|female|None|  6000|     HR|  NULL|20-5-2007|   Shruthi|    Sharma|         20|            5|        2007|
|  3|   Ganesh Kenjale|  male|  25|  NULL|FINANCE|    30|     NULL|    Ganesh|   Kenjale|       NULL|         NULL|        NULL|
|  4|    Pooja Chandra|female|NULL|  8000|PAYROLL|    40|14-4-1998|     Pooja|   Chandra|         14|            4|        1998|
|  5|     kamini sinha|female|  31|  6000|     IT|    50|20-5-2002|    kamini|     sinha|         20|            5|        2002|
|  6|        Rahul Roy|  NULL|  28|  NULL|   NULL|    10|31-8-2015|     Rahul|       Roy|         31|            8|        2015|
|  7|    Shweta Tiwari|female|  30|  6000|     HR|    20|     NULL|    Shweta|    Tiwari|       NULL|         NULL|        NULL|
|  8|   suresh Katwani|  NULL|  25| 10000|FINANCE|    30|22-3-2007|    suresh|   Katwani|         22|            3|        2007|
|  9|             NULL|  NULL|NULL|  NULL|   NULL|  NULL|     NULL|      NULL|      NULL|       NULL|         NULL|        NULL|
| 10|   prachi Inamdar|female|  30|  6000|   NULL|    50|     NULL|    prachi|   Inamdar|       NULL|         NULL|        NULL|
+---+-----------------+------+----+------+-------+------+---------+----------+----------+-----------+-------------+------------+

In [28]:
import  pandas as pd

empdf7=df4.toPandas()
empdf7

empdf7.to_csv('employees.csv',header=True,index=False)
empdf7.to_excel('emplyees.xlsx',header=True,index=False,sheet_name="sheet_name_1")

In [29]:
# split and drop splitted columns


df5= df.withColumn('first_name',split(df['name'],' ').getItem(0))\
       .withColumn('last_name',split(df['name'],' ').getItem(1))\
        .withColumn('joining_day',split(df['doj'],'-').getItem(0))\
        .withColumn('joining_month',split(df['doj'],'-').getItem(1))\
        .withColumn('joining_year',split(df['doj'],'-').getItem(2))\
        .drop(df['name'])\
        .drop(df['doj'])
    
df5.show()

+---+------+----+------+-------+------+----------+----------+-----------+-------------+------------+
| id|gender| age|salary|   dept|deptno|first_name| last_name|joining_day|joining_month|joining_year|
+---+------+----+------+-------+------+----------+----------+-----------+-------------+------------+
|  1|  male|  20|  5000|     IT|    50|    Mahesh|Kshirsagar|         19|            4|        2011|
|  2|female|None|  6000|     HR|  NULL|   Shruthi|    Sharma|         20|            5|        2007|
|  3|  male|  25|  NULL|FINANCE|    30|    Ganesh|   Kenjale|       NULL|         NULL|        NULL|
|  4|female|NULL|  8000|PAYROLL|    40|     Pooja|   Chandra|         14|            4|        1998|
|  5|female|  31|  6000|     IT|    50|    kamini|     sinha|         20|            5|        2002|
|  6|  NULL|  28|  NULL|   NULL|    10|     Rahul|       Roy|         31|            8|        2015|
|  7|female|  30|  6000|     HR|    20|    Shweta|    Tiwari|       NULL|         NULL|        NULL|
|  8|  NULL|  25| 10000|FINANCE|    30|    suresh|   Katwani|         22|            3|        2007|
|  9|  NULL|NULL|  NULL|   NULL|  NULL|      NULL|      NULL|       NULL|         NULL|        NULL|
| 10|female|  30|  6000|   NULL|    50|    prachi|   Inamdar|       NULL|         NULL|        NULL|
+---+------+----+------+-------+------+----------+----------+-----------+-------------+------------+